# Introdução a tipos de estruturas

Dicionarios

In [2]:
#importação de pacotes
import pandas as pd
import numpy as np

In [3]:
pd?

In [4]:
#criação do dicionário de dados
dados = {"canal_venda" : ["facebook", "twitter", "instagram", "linkedin", "facebook"],
        "acessos": [100, 200, 300, 400, 500],
        "site":["site1", "site1", "site2", "site2", "site3"],
        "vendas": [1000.52, 1052.34, 2002, 5000, 300]}

In [5]:
dados

{'canal_venda': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
 'acessos': [100, 200, 300, 400, 500],
 'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300]}

In [6]:
type(dados)

dict

In [7]:
dados.keys()

dict_keys(['canal_venda', 'acessos', 'site', 'vendas'])

Listas

In [8]:
#criando uma liista
lista = [200,200, 300, 800, 200]

In [9]:
dados['lista'] = lista

In [10]:
dados

{'canal_venda': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
 'acessos': [100, 200, 300, 400, 500],
 'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300],
 'lista': [200, 200, 300, 800, 200]}

Dataframes

In [11]:
dataframe = pd.DataFrame(dados)

In [12]:
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800
4    facebook      500  site3   300.00    200

In [13]:
dataframe.head(3)

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300

In [14]:
dataframe.shape

(5, 5)

In [15]:
dataframe.index

RangeIndex(start=0, stop=5, step=1)

In [16]:
dataframe.dtypes

canal_venda     object
acessos          int64
site            object
vendas         float64
lista            int64
dtype: object

In [17]:
dataframe.dtypes.value_counts()

object     2
int64      2
float64    1
dtype: int64

In [18]:
dataframe.isna()

   canal_venda  acessos   site  vendas  lista
0        False    False  False   False  False
1        False    False  False   False  False
2        False    False  False   False  False
3        False    False  False   False  False
4        False    False  False   False  False

In [19]:
dataframe.isna().sum()

canal_venda    0
acessos        0
site           0
vendas         0
lista          0
dtype: int64

In [20]:
dataframe.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista'], dtype='object')

In [21]:
dataframe['nova_coluna'] = [1, 2, 3, 4, 5]

In [22]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebook      100  site1  1000.52    200            1
1     twitter      200  site1  1052.34    200            2
2   instagram      300  site2  2002.00    300            3
3    linkedin      400  site2  5000.00    800            4
4    facebook      500  site3   300.00    200            5

In [23]:
dataframe.drop(columns = "nova_coluna", inplace = True)

In [24]:
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800
4    facebook      500  site3   300.00    200

In [25]:
dataframe.drop(columns = ['acessos', 'site'])

  canal_venda   vendas  lista
0    facebook  1000.52    200
1     twitter  1052.34    200
2   instagram  2002.00    300
3    linkedin  5000.00    800
4    facebook   300.00    200

In [26]:
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800
4    facebook      500  site3   300.00    200

In [1]:
dataframe.pivot(index="canal_venda", columns="site", values="acessos")

NameError: name 'dataframe' is not defined